Test_Plan1.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">C:\Users\VXChauhan\Downloads\sqljdbc_12.8.0.0_enu\sqljdbc_12.8\enu\jars\mssql-jdbc-12.8.0.jre11.jar</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request">
          <stringProp name="dataSource">mssql_pool</stringProp>
          <stringProp name="query">SELECT * FROM Local_PF1103
WHERE iDateEffective BETWEEN &apos;2024-10-2 11:00:00&apos; AND &apos;2024-10-24 19:00:00&apos;;

DELETE FROM Local_PF1103
WHERE iDateEffective BETWEEN &apos;2024-10-24 11:00:00&apos; AND &apos;2024-10-24 19:00:00&apos;;


TRUNCATE TABLE Local_PF1103



-- Insert 10 random records into PF1103 with random department names
DECLARE @counter INT = 1;
DECLARE @initialOfficeNum INT = 100;
DECLARE @initialEffectiveLvl INT = 1;
DECLARE @initialIndCtlNum INT = 2000;
DECLARE @initialCompanionCtlNum INT = 3000;
DECLARE @timezoneOffset INT = -5; 

WHILE @counter <= 10000
BEGIN
    INSERT INTO Local_PF1103 (iOfficeNum, sOfficeDept, iEffectiveLvl, iIndCtlNum, iCompanionCtlNum, sEmployeeID, sFirstName, sLastName, iDateEffective)
    VALUES (
        FLOOR(RAND() * 1000) + 1,                         
        CHAR(65 + FLOOR(RAND() * 26)) + CHAR(65 + FLOOR(RAND() * 26)) + CHAR(65 + FLOOR(RAND() * 26)),
        FLOOR(RAND() * 10) + 1,                           
        FLOOR(RAND() * 1000) + 1,                         
        FLOOR(RAND() * 1000) + 1,                         
        &apos;EMP&apos; + RIGHT(&apos;0000&apos; + CAST(FLOOR(RAND() * 10000) AS VARCHAR), 4),
        CHAR(65 + FLOOR(RAND() * 26)) + &apos;First&apos;,
        CHAR(65 + FLOOR(RAND() * 26)) + &apos;Last&apos;, 
          CONVERT(VARCHAR(19), DATEADD(HOUR, @timezoneOffset, GETUTCDATE()), 120)
    );
    
    SET @counter = @counter + 1;
END;</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <boolProp name="useGroupName">true</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration" enabled="true">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">mssql_pool</stringProp>
        <stringProp name="dbUrl">jdbc:sqlserver://CPC-Viren-9E0N7;DatabaseName=tpcxbb_1gb;trustServerCertificate=true</stringProp>
        <stringProp name="driver">com.microsoft.sqlserver.jdbc.SQLServerDriver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="password">Test@1234</stringProp>
        <stringProp name="poolMax">100</stringProp>
        <boolProp name="preinit">false</boolProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <stringProp name="username">sa</stringProp>
      </JDBCDataSource>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>